def common_languages(l):
    if not l:
        return "Невозможно составить список языков"
    elif len(l) == 1:
        return sorted(l[0])
    result = set(l[0])
    for i in l[1:]:
        result = result.intersection(set(i))
    return (sorted(result)) if result else "Невозможно составить список языков"


# Пример 1: общий язык есть
assert common_languages(
    [
        ["Русский", "Английский", "Французский"],
        ["Английский", "Французский", "Испанский"],
        ["Английский", "Французский", "Немецкий"],
    ]
) == [
    "Английский",
    "Французский",
]  # отсортировано

# Пример 2: общий язык только один
assert common_languages(
    [
        ["Русский", "Английский"],
        ["Английский", "Немецкий"],
        ["Английский", "Французский"],
    ]
) == ["Английский"]

# Пример 3: нет общего языка
assert (
    common_languages(
        [
            ["Русский", "Английский"],
            ["Французский", "Испанский"],
            ["Немецкий", "Итальянский"],
        ]
    )
    == "Невозможно составить список языков"
)

# Пример 4: все знают один и тот же язык
assert common_languages(
    [["Русский", "Английский"], ["Английский", "Русский"], ["Английский", "Русский"]]
) == [
    "Английский",
    "Русский",
]  # лексикографически

# Пример 5: один человек
assert common_languages([["Русский", "Английский", "Французский"]]) == [
    "Английский",
    "Русский",
    "Французский",
]  # лексикографически
